In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

# List of Data to Combine

+ usa_18_year_old_in_education_national.csv
+ usa_edu_teach_stud_outcomes_state.csv
+ usa_ele_sec_expenditure_percent_gov_states.csv
+ usa_GDP_per_capita_state.csv
+ usa_num_known_property_crimes_state.csv
+ usa_per_capita_income_state.csv
+ usa_population_state.csv
+ usa_tax_collection_state.csv
+ usa_unemployment_rate_state.csv
+ usa_youth_access_to_edu_national.csv
+ elsect_summary.csv

# Data loading

## Educational finance summary

+ 1992 ~ 2015

In [2]:
df0 = pd.read_csv('./data/data_raw/elsect_summary.csv')

In [3]:
df0 = df0[['STATE', 'YEAR', 'ENROLL', 'TOTAL_REVENUE', 'TOTAL_EXPENDITURE']]

In [4]:
df0.columns = ['State', 'Year', 'Enroll', 'Total_Revenue', 'Total_Expenditure']

In [5]:
df0.Year.unique()

array([1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002,
       2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013,
       2014, 2015])

In [6]:
df= df0

## usa_edu_teach_stud_outcomes_state

In [7]:
df0 = pd.read_csv('./data/data_raw/usa_edu_teach_stud_outcomes_state.csv')

In [8]:
df0.head()

,region,indicator,Unit,Date,Value
0,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2000,72.247694
1,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2009,79.927800
2,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2011,81.830900
3,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2012,84.477400
4,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2013,81.905100

In [9]:
df0.indicator.unique()

array(['18- to 24-Year-Olds Who Were High School Completers',
       "Population 25 Years Old and Over Who Have Bachelor's or Higher Degree",
       'Enrollment in Public Elementary and Secondary Schools',
       'Average Daily Attendance in Public Elementary and Secondary Schools',
       'Public Elementary and Secondary Teachers',
       'Pupil/Teacher Ratios in Public Elementary and Secondary Schools',
       'Public High School Graduates',
       'Current Expenditure per Pupil in Average Daily Attendance in Public Elementary and Secondary Schools'],
      dtype=object)

enrollment data, missing 1991 ~1994 data, take from the other data set, **Drop**

In [10]:
df0[df0.indicator == 'Enrollment in Public Elementary and Secondary Schools'].Date.unique()

array([1990, 1995, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
       2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016])

In [11]:
df0 = df0[df0.indicator != 'Enrollment in Public Elementary and Secondary Schools']

Average daily attendance in pub & ele schools, **NOT Complete**  *might be usefull* missing data 1991~1999, 2015

In [12]:
df0[df0.indicator == 'Average Daily Attendance in Public Elementary and Secondary Schools'].Date.unique()

array([1990, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013, 2014])

Public Elementary and Secondary Teachers  **Drop**

In [13]:
df0[df0.indicator== 'Public Elementary and Secondary Teachers'].Date.unique()

array([2000, 2005, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014])

In [14]:
df0 = df0[df0.indicator != 'Public Elementary and Secondary Teachers']

'18- to 24-Year-Olds Who Were High School Completers', **Drop**

In [15]:
df0[df0.indicator == '18- to 24-Year-Olds Who Were High School Completers'].Date.unique()

array([2000, 2009, 2011, 2012, 2013, 2014])

In [16]:
df0 = df0[df0.indicator != '18- to 24-Year-Olds Who Were High School Completers']

"Population 25 Years Old and Over Who Have Bachelor's or Higher Degree", **Drop**

In [17]:
df0[df0.indicator =="Population 25 Years Old and Over Who Have Bachelor's or Higher Degree"].Date.unique()

array([2000, 2009, 2011, 2012, 2013, 2014])

'Pupil/Teacher Ratios in Public Elementary and Secondary Schools', **Drop**

In [18]:
df0 = df0[df0.indicator !="Population 25 Years Old and Over Who Have Bachelor's or Higher Degree"]

In [19]:
df0[df0.indicator =='Pupil/Teacher Ratios in Public Elementary and Secondary Schools'].Date.unique()

array([2000, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014])

'Public High School Graduates' **NOT complete**, *Might be useful*

In [20]:
df0[df0.indicator == 'Public High School Graduates'].Date.unique()

array([1990, 2000, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012,
       2013, 2014, 2015, 2016])

'Current Expenditure per Pupil in Average Daily Attendance in Public Elementary and Secondary Schools', **USE**

In [21]:
df0[df0.indicator == 'Current Expenditure per Pupil in Average Daily Attendance in Public Elementary and Secondary Schools'].Date.unique()

array([1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
       2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014])

In [22]:
df0.head()

,region,indicator,Unit,Date,Value
31,Alabama,Average Daily Attendance in Public Elementary ...,Number,1990,683833.0
32,Alabama,Average Daily Attendance in Public Elementary ...,Number,2000,725212.0
33,Alabama,Average Daily Attendance in Public Elementary ...,Number,2001,702423.0
34,Alabama,Average Daily Attendance in Public Elementary ...,Number,2002,701235.0
35,Alabama,Average Daily Attendance in Public Elementary ...,Number,2003,706446.0

In [23]:
df0.region.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [24]:
df0.region.unique()  == df.State.unique()

array([ True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True])

In [25]:
df = df.join(
    df0[df0.indicator == 'Current Expenditure per Pupil in Average Daily Attendance in Public Elementary and Secondary Schools']\
    .set_index(['region', 'Date']), how= 'left',on = ['State', 'Year'])

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1224 entries, 0 to 1223
Data columns (total 8 columns):
State                1224 non-null object
Year                 1224 non-null int64
Enroll               1173 non-null float64
Total_Revenue        1224 non-null int64
Total_Expenditure    1224 non-null int64
indicator            1173 non-null object
Unit                 1173 non-null object
Value                1173 non-null float64
dtypes: float64(2), int64(3), object(3)
memory usage: 76.6+ KB

In [26]:
df = df.drop(['indicator', 'Unit'], axis = 1)

df.columns = df.columns.str.replace('Value', 'Expenditure_Per_Pupil')

In [27]:
df.head()

,State,Year,Enroll,Total_Revenue,Total_Expenditure,Expenditure_Per_Pupil
0,Alabama,1992,NaN,2678885,2653798,3616.0
1,Alaska,1992,NaN,1049591,972488,8450.0
2,Arizona,1992,NaN,3258079,3401580,4381.0
3,Arkansas,1992,NaN,1711959,1743022,4031.0
4,California,1992,NaN,26260025,27138832,4746.0

## usa_ele_sec_expenditure_percent_gov_states

In [28]:
df0 = pd.read_csv('./data/data_raw/usa_ele_sec_expenditure_percent_gov_states.csv')

** Might be useful** Not complete

In [29]:
df0.Date.unique()

array([1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
       2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016])

In [30]:
df0.head()

,region,indicator,Unit,Date,Value
0,Connecticut,Elementary and Secondary Education Expenditure...,%,1998,14.4
1,Connecticut,Elementary and Secondary Education Expenditure...,%,1999,15.2
2,Connecticut,Elementary and Secondary Education Expenditure...,%,2000,13.7
3,Connecticut,Elementary and Secondary Education Expenditure...,%,2001,13.6
4,Connecticut,Elementary and Secondary Education Expenditure...,%,2002,13.3

## usa_18_year_old_in_education_national

In [31]:
df0 = pd.read_csv('./data/data_raw/usa_18_year_old_in_education_national.csv')

**Drop**

In [32]:
df0.Date.unique()

array([2001, 2002, 2003, 2004, 2005, 2012])

## usa_population_state.csv

In [33]:
df0 = pd.read_csv('./data/data_raw/usa_population_state.csv')

In [34]:
len(df0.region.unique())

51

In [35]:
df0.head()

    region                    series               Unit  Date     Value
0  Alabama  Resident Population, NSA  Thous. of Persons  1992  4139.269
1  Alabama  Resident Population, NSA  Thous. of Persons  1993  4193.114
2  Alabama  Resident Population, NSA  Thous. of Persons  1994  4232.965
3  Alabama  Resident Population, NSA  Thous. of Persons  1995  4262.731
4  Alabama  Resident Population, NSA  Thous. of Persons  1996  4290.403

In [36]:
df0 = df0.drop(['series', 'Unit'], axis = 1)
df0.Value = df0.Value * 1000

In [37]:
df0.head()

    region  Date      Value
0  Alabama  1992  4139269.0
1  Alabama  1993  4193114.0
2  Alabama  1994  4232965.0
3  Alabama  1995  4262731.0
4  Alabama  1996  4290403.0

Take care of different state names:  
District of Columbia, DC ---> District of Columbia  
New York (States) --- > New York

In [38]:
df0.region.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia, DC',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York (States)', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [39]:
df.State.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [40]:
df0.region = df0.region.str.replace('District of Columbia, DC', 'District of Columbia')
df0.region = df0.region.str.replace('New York \(States\)', 'New York')

In [41]:
df0.region.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [42]:
df = df.join(df0.set_index(['region', 'Date']), how= 'left',on = ['State', 'Year'])

In [43]:
df.columns = df.columns.str.replace('Value', 'Population')

In [44]:
df.head()

,State,Year,Enroll,Total_Revenue,Total_Expenditure,Expenditure_Per_Pupil,Population
0,Alabama,1992,NaN,2678885,2653798,3616.0,4139269.0
1,Alaska,1992,NaN,1049591,972488,8450.0,587073.0
2,Arizona,1992,NaN,3258079,3401580,4381.0,3867333.0
3,Arkansas,1992,NaN,1711959,1743022,4031.0,2394098.0
4,California,1992,NaN,26260025,27138832,4746.0,30875920.0

In [45]:
df.isnull().sum()

State                     0
Year                      0
Enroll                   51
Total_Revenue             0
Total_Expenditure         0
Expenditure_Per_Pupil    51
Population                0
dtype: int64

## usa_GDP_per_capita_state

+ Per capita read GDP by state
+ All industry total
+ chained 2009 dollars

In [46]:
df0 = pd.read_csv('./data/data_raw/usa_GDP_per_capita_state.csv')

In [47]:
df0.Date.unique()

array([1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007,
       2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016])

In [48]:
df0.head()

,classification,state,component,industry,Unit,Date,Value
0,NAICS,Connecticut,Per capita real GDP by state,All industry total,chained 2009 dollars,1997,54740
1,NAICS,Connecticut,Per capita real GDP by state,All industry total,chained 2009 dollars,1998,56416
2,NAICS,Connecticut,Per capita real GDP by state,All industry total,chained 2009 dollars,1999,57724
3,NAICS,Connecticut,Per capita real GDP by state,All industry total,chained 2009 dollars,2000,61355
4,NAICS,Connecticut,Per capita real GDP by state,All industry total,chained 2009 dollars,2001,61872

In [49]:
df = df.join(df0[['state', 'Date', 'Value']].set_index(['state', 'Date']), on = ['State', 'Year'], how = 'left')

In [50]:
df.columns = df.columns.str.replace('Value', 'GDP_Per_Capita')
df.head()

,State,Year,Enroll,Total_Revenue,Total_Expenditure,Expenditure_Per_Pupil,Population,GDP_Per_Capita
0,Alabama,1992,NaN,2678885,2653798,3616.0,4139269.0,NaN
1,Alaska,1992,NaN,1049591,972488,8450.0,587073.0,NaN
2,Arizona,1992,NaN,3258079,3401580,4381.0,3867333.0,NaN
3,Arkansas,1992,NaN,1711959,1743022,4031.0,2394098.0,NaN
4,California,1992,NaN,26260025,27138832,4746.0,30875920.0,NaN

## usa_tax_collection_state.csv

In [51]:
df0 = pd.read_csv('./data/data_raw/usa_tax_collection_state.csv')

In [52]:
df0.Date.unique()

array([1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002,
       2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013,
       2014, 2015, 2016])

In [53]:
len(df0.region.unique())

46

In [54]:
df0.region.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'Florida', 'Georgia',
       'Hawaii', 'Idaho', 'Illinois', 'Indiana', 'Iowa', 'Kansas',
       'Kentucky', 'Louisiana', 'Maine', 'Maryland', 'Massachusetts',
       'Michigan', 'Minnesota', 'Mississippi', 'Missouri', 'Montana',
       'Nebraska', 'New Hampshire', 'New Jersey', 'New Mexico',
       'New York (States)', 'North Carolina', 'North Dakota', 'Ohio',
       'Oklahoma', 'Oregon', 'Pennsylvania', 'Rhode Island',
       'South Carolina', 'South Dakota', 'Tennessee', 'Utah', 'Vermont',
       'Virginia', 'West Virginia', 'Wisconsin'], dtype=object)

In [55]:
df.State.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [56]:
df0.head()

,region,series,Unit,Date,Value
0,Alabama,"State Government Tax Collections, Corporation ...",Thous. of $,1992,164779
1,Alabama,"State Government Tax Collections, Corporation ...",Thous. of $,1993,189506
2,Alabama,"State Government Tax Collections, Corporation ...",Thous. of $,1994,218131
3,Alabama,"State Government Tax Collections, Corporation ...",Thous. of $,1995,236279
4,Alabama,"State Government Tax Collections, Corporation ...",Thous. of $,1996,217616

In [57]:
df0.region = df0.region.str.replace('District of Columbia, DC', 'District of Columbia')
df0.region = df0.region.str.replace('New York \(States\)', 'New York')

In [58]:
df0.Value = df0.Value * 1000

In [59]:
df = df.join(df0[['region', 'Date', 'Value']].set_index(['region', 'Date']), how = 'left', on = ['State', 'Year'])
df.columns = df.columns.str.replace('Value', 'State_Tax_Collection')
df.head()

,State,Year,Enroll,Total_Revenue,Total_Expenditure,Expenditure_Per_Pupil,Population,GDP_Per_Capita,State_Tax_Collection
0,Alabama,1992,NaN,2678885,2653798,3616.0,4139269.0,NaN,1.647790e+08
1,Alaska,1992,NaN,1049591,972488,8450.0,587073.0,NaN,2.000250e+08
2,Arizona,1992,NaN,3258079,3401580,4381.0,3867333.0,NaN,2.108240e+08
3,Arkansas,1992,NaN,1711959,1743022,4031.0,2394098.0,NaN,1.255250e+08
4,California,1992,NaN,26260025,27138832,4746.0,30875920.0,NaN,4.518418e+09

## usa_per_capita_income_state.csv

In [60]:
df0 = pd.read_csv('./data/data_raw/usa_per_capita_income_state.csv')

In [61]:
df0.head()

    region                           series Unit  Date  Value
0  Alabama  Per Capita Personal Income, NSA    $  1992  17537
1  Alabama  Per Capita Personal Income, NSA    $  1993  18082
2  Alabama  Per Capita Personal Income, NSA    $  1994  18938
3  Alabama  Per Capita Personal Income, NSA    $  1995  19866
4  Alabama  Per Capita Personal Income, NSA    $  1996  20569

In [62]:
df0.region = df0.region.str.replace('District of Columbia, DC', 'District of Columbia')
df0.region = df0.region.str.replace('New York \(States\)', 'New York')

In [63]:
df = df.join(df0[['region', 'Date', 'Value']].set_index(['region', 'Date']), how = 'left', on = ['State', 'Year'])
df.columns  = df.columns.str.replace('Value', 'Income_Per_Capita')
df.head()

,State,Year,Enroll,Total_Revenue,Total_Expenditure,Expenditure_Per_Pupil,Population,GDP_Per_Capita,State_Tax_Collection,Income_Per_Capita
0,Alabama,1992,NaN,2678885,2653798,3616.0,4139269.0,NaN,1.647790e+08,17537
1,Alaska,1992,NaN,1049591,972488,8450.0,587073.0,NaN,2.000250e+08,23938
2,Arizona,1992,NaN,3258079,3401580,4381.0,3867333.0,NaN,2.108240e+08,18129
3,Arkansas,1992,NaN,1711959,1743022,4031.0,2394098.0,NaN,1.255250e+08,16451
4,California,1992,NaN,26260025,27138832,4746.0,30875920.0,NaN,4.518418e+09,22644

## usa_num_known_property_crimes_state

In [64]:
df0 = pd.read_csv('./data/data_raw/usa_num_known_property_crimes_state.csv')

In [65]:
df0.Date.unique()

array([1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
       2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014, 2015, 2016])

take care of name :  
'District Of Columbia' -- > 'District of Columbia'

In [66]:
df0.location.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District Of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [67]:
df.State.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [68]:
df0.location = df0.location.str.replace('District Of Columbia', 'District of Columbia')

In [69]:
df0.head()

  location                                  indicator     Unit  Date   Value
0  Alabama  Number of Property Crimes Known to Police  numbers  1990  161838
1  Alabama  Number of Property Crimes Known to Police  numbers  1991  168864
2  Alabama  Number of Property Crimes Known to Police  numbers  1992  163966
3  Alabama  Number of Property Crimes Known to Police  numbers  1993  168182
4  Alabama  Number of Property Crimes Known to Police  numbers  1994  174589

In [70]:
df = df.join(df0[['location', 'Date', 'Value']].set_index(['location', 'Date']), how = 'left', on = ['State', 'Year'])
df.columns = df.columns.str.replace('Value', 'Known_Property_Crimes')
df.head()

,State,Year,Enroll,Total_Revenue,Total_Expenditure,Expenditure_Per_Pupil,Population,GDP_Per_Capita,State_Tax_Collection,Income_Per_Capita,Known_Property_Crimes
0,Alabama,1992,NaN,2678885,2653798,3616.0,4139269.0,NaN,1.647790e+08,17537,163966.0
1,Alaska,1992,NaN,1049591,972488,8450.0,587073.0,NaN,2.000250e+08,23938,28394.0
2,Arizona,1992,NaN,3258079,3401580,4381.0,3867333.0,NaN,2.108240e+08,18129,235883.0
3,Arkansas,1992,NaN,1711959,1743022,4031.0,2394098.0,NaN,1.255250e+08,16451,100069.0
4,California,1992,NaN,26260025,27138832,4746.0,30875920.0,NaN,4.518418e+09,22644,1715360.0

## usa_unemployment_rate_state

In [71]:
df0 = pd.read_csv('./data/data_raw/usa_unemployment_rate_state.csv')
df0.head()

    region                 series Unit    Date  Value
0  Alabama  Unemployment Rate, SA    %  1990M1    6.7
1  Alabama  Unemployment Rate, SA    %  1990M2    6.7
2  Alabama  Unemployment Rate, SA    %  1990M3    6.7
3  Alabama  Unemployment Rate, SA    %  1990M4    6.7
4  Alabama  Unemployment Rate, SA    %  1990M5    6.6

In [72]:
df0.region.unique()  == df.State.unique()

array([ True,  True,  True,  True,  True,  True,  True,  True, False,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True, False,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True])

In [73]:
df0.region = df0.region.str.replace('District of Columbia, DC', 'District of Columbia')
df0.region = df0.region.str.replace('New York \(States\)', 'New York')

In [74]:
df0.Date = pd.to_datetime(df0.Date, format='%YM%m', errors='coerce')

In [75]:
df0.head()

    region                 series Unit       Date  Value
0  Alabama  Unemployment Rate, SA    % 1990-01-01    6.7
1  Alabama  Unemployment Rate, SA    % 1990-02-01    6.7
2  Alabama  Unemployment Rate, SA    % 1990-03-01    6.7
3  Alabama  Unemployment Rate, SA    % 1990-04-01    6.7
4  Alabama  Unemployment Rate, SA    % 1990-05-01    6.6

In [76]:
df0  = df0.set_index('Date').groupby('region').Value.resample('Y').mean().to_frame().reset_index()
df0.head()

    region       Date     Value
0  Alabama 1990-12-31  6.791667
1  Alabama 1991-12-31  7.350000
2  Alabama 1992-12-31  7.566667
3  Alabama 1993-12-31  7.366667
4  Alabama 1994-12-31  6.191667

In [77]:
df0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1428 entries, 0 to 1427
Data columns (total 3 columns):
region    1428 non-null object
Date      1428 non-null datetime64[ns]
Value     1428 non-null float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 33.5+ KB

In [78]:
df0.Date = df0.Date.astype(str).apply(lambda x: x[:4])

In [79]:
df0.Value = df0.Value * 0.01

In [80]:
df0.Date = df0.Date.astype(int)

In [81]:
df0.head()

    region  Date     Value
0  Alabama  1990  0.067917
1  Alabama  1991  0.073500
2  Alabama  1992  0.075667
3  Alabama  1993  0.073667
4  Alabama  1994  0.061917

In [82]:
df = df.join(df0[['region', 'Date', 'Value']].set_index(['region', 'Date']), how = 'left', on = ['State', 'Year'])
df.columns = df.columns.str.replace('Value', 'Unemployment_Rate')
df.head()

,State,Year,Enroll,Total_Revenue,Total_Expenditure,Expenditure_Per_Pupil,Population,GDP_Per_Capita,State_Tax_Collection,Income_Per_Capita,Known_Property_Crimes,Unemployment_Rate
0,Alabama,1992,NaN,2678885,2653798,3616.0,4139269.0,NaN,1.647790e+08,17537,163966.0,0.075667
1,Alaska,1992,NaN,1049591,972488,8450.0,587073.0,NaN,2.000250e+08,23938,28394.0,0.089167
2,Arizona,1992,NaN,3258079,3401580,4381.0,3867333.0,NaN,2.108240e+08,18129,235883.0,0.075417
3,Arkansas,1992,NaN,1711959,1743022,4031.0,2394098.0,NaN,1.255250e+08,16451,100069.0,0.070917
4,California,1992,NaN,26260025,27138832,4746.0,30875920.0,NaN,4.518418e+09,22644,1715360.0,0.093000

In [83]:
df.isnull().sum()

State                      0
Year                       0
Enroll                    51
Total_Revenue              0
Total_Expenditure          0
Expenditure_Per_Pupil     51
Population                 0
GDP_Per_Capita           255
State_Tax_Collection     120
Income_Per_Capita          0
Known_Property_Crimes      5
Unemployment_Rate          0
dtype: int64

In [84]:
df0.Date.unique()

array([1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
       2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014, 2015, 2016, 2017])

In [87]:
#df.to_csv('./data/data_cleaned/combined_data_state_level.csv', index = False)

# National Level Data

+ us-dollar-index-historical-chart.csv
+ usa_youth_access_to_edu_national.csv
+ usa_18_year_old_in_education_national.csv